<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9e8a16ab9647eba0fc797bc1dd3e6df34b398505732d6a704f7fbfecfe370a11","plan_job_ref":"Job .github/workflows/_test-tf.yaml #177 at https://github.com/DND-IT/github-workflows/actions/runs/22462591123","plan_out_hash":"31be967b5dd236e2f118d6d13670c4dc660a9b060e272c5007f7d9cae3d49caf","plan_hash":"d82d3e6b84524960545846b1fc87ca5fa008e91af1b4e51f3506f7ee3faa7551","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #177](https://github.com/DND-IT/github-workflows/actions/runs/22462591123)